In [3]:
import pandas as pd
import numpy as np

In [52]:

data={'one':pd.Series([1,2,3,4]),
     'two':pd.Series([10,20,30,40]),
     'three':pd.Series([100,200,300,400]),
     'four':pd.Series([1000,2000,3000,4000])}

In [53]:
df=pd.DataFrame(data)

In [54]:
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [10]:
del df['four']

In [11]:
df

   one  two  three
0    1   10    100
1    2   20    200
2    3   30    300
3    4   40    400

In [12]:
df

   one  two  three
0    1   10    100
1    2   20    200
2    3   30    300
3    4   40    400

In [ ]:
df.pop('three')
df

In [15]:
df

   one  two
0    1   10
1    2   20
2    3   30
3    4   40

##### Addition of rows:

In [23]:
df1=pd.DataFrame([[1,2],[3,4]], columns=['a','b'])
df1=pd.DataFrame([[6,7],[13,44]], columns=['a','b'])

df1

    a   b
0   6   7
1  13  44

In [25]:
df1.append(df2)

AttributeError: 'DataFrame' object has no attribute 'append'

 no append

##### pandas drop function:

In [33]:
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

axis=0 => rows(row wise):

In [35]:
df.drop([0,1], axis=0)

   one  two  three  four
2    3   30    300  3000
3    4   40    400  4000

In [41]:
df.drop([0,1], axis=0, inplace=True)

In [47]:
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [55]:
df.drop(['one','three'], axis=1, inplace=True)

In [57]:
df

   two  four
0   10  1000
1   20  2000
2   30  3000
3   40  4000

##### Transposing:

In [63]:

data={'one':pd.Series([1,2,3,4]),
     'two':pd.Series([10,20,30,40]),
     'three':pd.Series([100,200,300,400]),
     'four':pd.Series([1000,2000,3000,4000])}

In [64]:
df=pd.DataFrame(data)

In [61]:
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [62]:
df.T

          0     1     2     3
one       1     2     3     4
two      10    20    30    40
three   100   200   300   400
four   1000  2000  3000  4000

##### a set of more dataset func:

In [65]:
df.axes

[RangeIndex(start=0, stop=4, step=1),
 Index(['one', 'two', 'three', 'four'], dtype='object')]

In [66]:
df.ndim       #dimension

2

In [67]:
df.dtypes

one      int64
two      int64
three    int64
four     int64
dtype: object

In [68]:
df.shape

(4, 4)

In [79]:
d={'Name':pd.Series(['Tom','Jerry','Spike','dawg','fawg','hawg','mawg']),
  'Age':pd.Series([10,20,30,40,50,60,70]),
  'Height':pd.Series([3.3,4.5,44.5,33,44,55,66])}

In [80]:
df=pd.DataFrame(d)

In [81]:
df

    Name  Age  Height
0    Tom   10     3.3
1  Jerry   20     4.5
2  Spike   30    44.5
3   dawg   40    33.0
4   fawg   50    44.0
5   hawg   60    55.0
6   mawg   70    66.0

In [82]:
df.head()

    Name  Age  Height
0    Tom   10     3.3
1  Jerry   20     4.5
2  Spike   30    44.5
3   dawg   40    33.0
4   fawg   50    44.0

In [84]:
df.head(2)

    Name  Age  Height
0    Tom   10     3.3
1  Jerry   20     4.5

In [87]:
df.tail(3)

   Name  Age  Height
4  fawg   50    44.0
5  hawg   60    55.0
6  mawg   70    66.0

In [89]:
df.empty

False